#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/namitjagtiani/gh-actions-demo/runs/run-8nxGSXKYdwFQeSYr

Waiting for the plan to start...

Terraform v0.15.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_pet.sg: Refreshing state... [id=leading-insect]
azurerm_resource_group.wus-rg: Refreshing state... [id=/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-vnet]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_network_security_group.wus-nsg will be created
  + resource "azurerm_network_security_group" "wus-nsg" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "NSGS1"
      + resource_group_name = "wus-rg"
      + security_rule       = (known after apply)
    }

  # azurerm_resource_group.wus-rg must be replaced
-/+ resource "azurerm_resource_group" "wus-rg" {
      ~ id       = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-vnet" -> (known after apply)
      ~ name     = "wus-vnet" -> "wus-rg" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = [
          + "10.0.0.4",
          + "10.0.0.5",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westus"
      + name                  = "virtualNetwork1"
      + resource_group_name   = "wus-rg"
      + subnet                = [
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = (known after apply)
              + name           = "subnet1"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = (known after apply)
              + name           = "subnet2"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.3.0/24"
              + id             = (known after apply)
              + name           = "subnet3"
              + security_group = (known after apply)
            },
        ]
      + tags                  = {
          + "environment" = "Production"
        }
      + vm_protection_enabled = false
    }

Plan: 3 to add, 0 to change, 1 to destroy.

```

</details>

*Pusher: @namitjagtiani, Action: `pull_request`*